garyPenhook/PIC-Assembler/edc/PIC18F56Q24.PIC
          <edc:SFRDef edc:access="--rrrrrr" edc:cname="DMAnSPTRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="DMAnSPTRU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF5">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SPTR" edc:mask="0x3f" edc:name="SPTR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SPTR16" edc:mask="0x1" edc:name="SPTR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR17" edc:mask="0x1" edc:name="SPTR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR18" edc:mask="0x1" edc:name="SPTR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR19" edc:mask="0x1" edc:name="SPTR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR20" edc:mask="0x1" edc:name="SPTR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR21" edc:mask="0x1" edc:name="SPTR21" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnSSZ" edc:desc="DMA source size register" edc:name="DMAnSSZ" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF6">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSZL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSZL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF6">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSZ" edc:mask="0xff" edc:name="SSZ" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SSZ0" edc:mask="0x1" edc:name="SSZ0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ1" edc:mask="0x1" edc:name="SSZ1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ2" edc:mask="0x1" edc:name="SSZ2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ3" edc:mask="0x1" edc:name="SSZ3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ4" edc:mask="0x1" edc:name="SSZ4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ5" edc:mask="0x1" edc:name="SSZ5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ6" edc:mask="0x1" edc:name="SSZ6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ7" edc:mask="0x1" edc:name="SSZ7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="DMAnSSZH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="DMAnSSZH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF7">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSZ" edc:mask="0xf" edc:name="SSZ" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SSZ8" edc:mask="0x1" edc:name="SSZ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ9" edc:mask="0x1" edc:name="SSZ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ10" edc:mask="0x1" edc:name="SSZ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ11" edc:mask="0x1" edc:name="SSZ11" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnSSA" edc:desc="DMA source address register" edc:name="DMAnSSA" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF8">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSAL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSAL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF8">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0xff" edc:name="SSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA0" edc:mask="0x1" edc:name="SSA0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA1" edc:mask="0x1" edc:name="SSA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA2" edc:mask="0x1" edc:name="SSA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA3" edc:mask="0x1" edc:name="SSA3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA4" edc:mask="0x1" edc:name="SSA4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA5" edc:mask="0x1" edc:name="SSA5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA6" edc:mask="0x1" edc:name="SSA6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA7" edc:mask="0x1" edc:name="SSA7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
