garyPenhook/PIC-Assembler/edc/PIC18F56Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x153">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rnnn" edc:cname="PORTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="PORTE" edc:nzwidth="0x8" edc:por="----xxxx" edc:_addr="0x154">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTF" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x155">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7" edc:desc="" edc:mask="0x1" edc:name="RF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xAA" edc:_addr="0x156"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x2" edc:beginaddr="0x0200" edc:endaddr="0x0300" edc:regionid="sfr2">
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x200">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x201">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS0" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS1" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS2" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS3" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS4" edc:mask="0x1" edc:name="RA0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS5" edc:mask="0x1" edc:name="RA0PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x202">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS0" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS1" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS2" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS3" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS4" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS5" edc:mask="0x1" edc:name="RA1PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x203">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS0" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS1" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS2" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS3" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS4" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS5" edc:mask="0x1" edc:name="RA2PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA3PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x204">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA3PPS0" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS1" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS2" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS3" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS4" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS5" edc:mask="0x1" edc:name="RA3PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x205">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS0" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS1" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS2" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS3" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS4" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS5" edc:mask="0x1" edc:name="RA4PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
