garyPenhook/PIC-Assembler/edc/PIC18F56Q24.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T6INPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T6INPPS" edc:nzwidth="8" edc:por="--001111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x24A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6INPPS0" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS1" edc:mask="0x1" edc:name="T6INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS2" edc:mask="0x1" edc:name="T6INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS3" edc:mask="0x1" edc:name="T6INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS4" edc:mask="0x1" edc:name="T6INPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS5" edc:mask="0x1" edc:name="T6INPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6INPPS" edc:mask="0x3f" edc:name="T6INPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x24B"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CCP1PPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x24F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1PPS0" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS1" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS2" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS3" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS4" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS5" edc:mask="0x1" edc:name="CCP1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1PPS" edc:mask="0x3f" edc:name="CCP1PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CCP2PPS" edc:nzwidth="8" edc:por="--010001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x250">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2PPS0" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS1" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS2" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS3" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS4" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS5" edc:mask="0x1" edc:name="CCP2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2PPS" edc:mask="0x3f" edc:name="CCP2PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWM1ERSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWM1ERSPPS" edc:nzwidth="8" edc:por="--010011" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x251">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS0" edc:mask="0x1" edc:name="PWM1ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS1" edc:mask="0x1" edc:name="PWM1ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS2" edc:mask="0x1" edc:name="PWM1ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS3" edc:mask="0x1" edc:name="PWM1ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS4" edc:mask="0x1" edc:name="PWM1ERSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS5" edc:mask="0x1" edc:name="PWM1ERSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS" edc:mask="0x3f" edc:name="PWM1ERSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWM2ERSPPS" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWM2ERSPPS" edc:nzwidth="8" edc:por="--001101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x252">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS0" edc:mask="0x1" edc:name="PWM2ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS1" edc:mask="0x1" edc:name="PWM2ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS2" edc:mask="0x1" edc:name="PWM2ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS3" edc:mask="0x1" edc:name="PWM2ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS4" edc:mask="0x1" edc:name="PWM2ERSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS5" edc:mask="0x1" edc:name="PWM2ERSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS" edc:mask="0x3f" edc:name="PWM2ERSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWM3ERSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWM3ERSPPS" edc:nzwidth="8" edc:por="--001111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x253">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS0" edc:mask="0x1" edc:name="PWM3ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS1" edc:mask="0x1" edc:name="PWM3ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS2" edc:mask="0x1" edc:name="PWM3ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS3" edc:mask="0x1" edc:name="PWM3ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS4" edc:mask="0x1" edc:name="PWM3ERSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS5" edc:mask="0x1" edc:name="PWM3ERSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS" edc:mask="0x3f" edc:name="PWM3ERSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x254"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWMIN0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWMIN0PPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x257">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWMIN0PPS" edc:mask="0x3f" edc:name="PWMIN0PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWMIN0PPS0" edc:mask="0x1" edc:name="PWMIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS1" edc:mask="0x1" edc:name="PWMIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS2" edc:mask="0x1" edc:name="PWMIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS3" edc:mask="0x1" edc:name="PWMIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS4" edc:mask="0x1" edc:name="PWMIN0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS5" edc:mask="0x1" edc:name="PWMIN0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWMIN1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWMIN1PPS" edc:nzwidth="8" edc:por="--010001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x258">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWMIN1PPS" edc:mask="0x3f" edc:name="PWMIN1PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWMIN1PPS0" edc:mask="0x1" edc:name="PWMIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS1" edc:mask="0x1" edc:name="PWMIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS2" edc:mask="0x1" edc:name="PWMIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS3" edc:mask="0x1" edc:name="PWMIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS4" edc:mask="0x1" edc:name="PWMIN1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS5" edc:mask="0x1" edc:name="PWMIN1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
