garyPenhook/PIC-Assembler/edc/PIC18F56Q24.PIC
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x259"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CWG1PPS" edc:nzwidth="8" edc:por="--001000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x25B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1INPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:mask="0x1" edc:name="CWG1INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:mask="0x1" edc:name="CWG1INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:mask="0x1" edc:name="CWG1INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:mask="0x1" edc:name="CWG1INPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS5" edc:mask="0x1" edc:name="CWG1INPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:mask="0x3f" edc:name="CWG1INPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS5" edc:mask="0x1" edc:name="CWGINPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x3f" edc:name="CWGINPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x25C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="I2C2SDAPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="I2C2SDAPPS" edc:nzwidth="8" edc:por="--001010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x25F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2C2SDAPPS0" edc:mask="0x1" edc:name="I2C2SDAPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SDAPPS1" edc:mask="0x1" edc:name="I2C2SDAPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SDAPPS2" edc:mask="0x1" edc:name="I2C2SDAPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SDAPPS3" edc:mask="0x1" edc:name="I2C2SDAPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SDAPPS4" edc:mask="0x1" edc:name="I2C2SDAPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SDAPPS5" edc:mask="0x1" edc:name="I2C2SDAPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C2SDAPPS" edc:mask="0x3f" edc:name="I2C2SDAPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="I2C2SCLPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="I2C2SCLPPS" edc:nzwidth="8" edc:por="--001001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x260">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2C2SCLPPS0" edc:mask="0x1" edc:name="I2C2SCLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SCLPPS1" edc:mask="0x1" edc:name="I2C2SCLPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SCLPPS2" edc:mask="0x1" edc:name="I2C2SCLPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SCLPPS3" edc:mask="0x1" edc:name="I2C2SCLPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SCLPPS4" edc:mask="0x1" edc:name="I2C2SCLPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C2SCLPPS5" edc:mask="0x1" edc:name="I2C2SCLPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C2SCLPPS" edc:mask="0x3f" edc:name="I2C2SCLPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
