garyPenhook/PIC-Assembler/edc/PIC18F56Q24.PIC
        <edc:JoinedSFRDef edc:cname="U2BRG" edc:desc="" edc:name="U2BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D6">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGL" edc:desc="" edc:mask="0xff" edc:name="BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0xff" edc:name="BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="U2FIFO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00101110" edc:name="U2FIFO" edc:nzwidth="8" edc:por="00101110" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:desc="" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBE" edc:desc="" edc:mask="0x1" edc:name="RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XON" edc:desc="" edc:mask="0x1" edc:name="XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXIDL" edc:desc="" edc:mask="0x1" edc:name="RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBF" edc:desc="" edc:mask="0x1" edc:name="TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:desc="" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STPMD" edc:desc="" edc:mask="0x1" edc:name="STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXWRE" edc:desc="" edc:mask="0x1" edc:name="TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2RXBF" edc:desc="" edc:mask="0x1" edc:name="U2RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXBE" edc:desc="" edc:mask="0x1" edc:name="U2RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2XON" edc:desc="" edc:mask="0x1" edc:name="U2XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXIDL" edc:desc="" edc:mask="0x1" edc:name="U2RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXBF" edc:desc="" edc:mask="0x1" edc:name="U2TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXBE" edc:desc="" edc:mask="0x1" edc:name="U2TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2STPMD" edc:desc="" edc:mask="0x1" edc:name="U2STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXWRE" edc:desc="" edc:mask="0x1" edc:name="U2TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="U2RCIDL" edc:mask="0x1" edc:name="U2RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---n--" edc:cname="U2UIR" edc:desc="" edc:impl="0xc4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---0--" edc:name="U2UIR" edc:nzwidth="8" edc:por="00---0--" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ABDIE" edc:desc="" edc:mask="0x1" edc:name="ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ABDIF" edc:desc="" edc:mask="0x1" edc:name="ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUIF" edc:desc="" edc:mask="0x1" edc:name="WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2ABDIE" edc:desc="" edc:mask="0x1" edc:name="U2ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U2ABDIF" edc:desc="" edc:mask="0x1" edc:name="U2ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2WUIF" edc:desc="" edc:mask="0x1" edc:name="U2WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2ERRIR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="U2ERRIR" edc:nzwidth="8" edc:por="10000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2DA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="" edc:mask="0x1" edc:name="TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIF" edc:desc="" edc:mask="0x1" edc:name="RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIF" edc:desc="" edc:mask="0x1" edc:name="RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIF" edc:desc="" edc:mask="0x1" edc:name="FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIF" edc:desc="" edc:mask="0x1" edc:name="CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIF" edc:desc="" edc:mask="0x1" edc:name="PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIF" edc:desc="" edc:mask="0x1" edc:name="TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2TXCIF" edc:desc="" edc:mask="0x1" edc:name="U2TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXFOIF" edc:desc="" edc:mask="0x1" edc:name="U2RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXBKIF" edc:desc="" edc:mask="0x1" edc:name="U2RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2FERIF" edc:desc="" edc:mask="0x1" edc:name="U2FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CERIF" edc:desc="" edc:mask="0x1" edc:name="U2CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2ABDOVF" edc:desc="" edc:mask="0x1" edc:name="U2ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2PERIF" edc:desc="" edc:mask="0x1" edc:name="U2PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXMTIF" edc:desc="" edc:mask="0x1" edc:name="U2TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2ERRIE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2ERRIE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2DB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIE" edc:desc="" edc:mask="0x1" edc:name="TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIE" edc:desc="" edc:mask="0x1" edc:name="RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIE" edc:desc="" edc:mask="0x1" edc:name="RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIE" edc:desc="" edc:mask="0x1" edc:name="FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIE" edc:desc="" edc:mask="0x1" edc:name="CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVE" edc:desc="" edc:mask="0x1" edc:name="ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIE" edc:desc="" edc:mask="0x1" edc:name="PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIE" edc:desc="" edc:mask="0x1" edc:name="TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2TXCIE" edc:desc="" edc:mask="0x1" edc:name="U2TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXFOIE" edc:desc="" edc:mask="0x1" edc:name="U2RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXBKIE" edc:desc="" edc:mask="0x1" edc:name="U2RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2FERIE" edc:desc="" edc:mask="0x1" edc:name="U2FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CERIE" edc:desc="" edc:mask="0x1" edc:name="U2CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2ABDOVE" edc:desc="" edc:mask="0x1" edc:name="U2ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2PERIE" edc:desc="" edc:mask="0x1" edc:name="U2PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXMTIE" edc:desc="" edc:mask="0x1" edc:name="U2TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
