garyPenhook/PIC-Assembler/edc/PIC18F56Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x407">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF6" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF7" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELB" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x408">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELB0" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELB1" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELB2" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELB3" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELB4" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELB5" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELB6" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELB7" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x409">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUB0" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB1" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB2" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB3" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB4" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB5" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB6" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB7" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCB0" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB1" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB2" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB3" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB4" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB5" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB6" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB7" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONB" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRB0" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB1" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB2" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB3" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB4" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB5" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB6" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB7" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLB" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLB0" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB1" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB2" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB3" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB4" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB5" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB6" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB7" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBP" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBP0" edc:mask="0x1" edc:name="IOCBP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP1" edc:mask="0x1" edc:name="IOCBP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP2" edc:mask="0x1" edc:name="IOCBP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP3" edc:mask="0x1" edc:name="IOCBP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBN" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBN0" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN1" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN2" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN3" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
