garyPenhook/PIC-Assembler/edc/PIC18F56Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBF0" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF1" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF2" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF3" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ANSELC" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ANSELC" edc:nzwidth="8" edc:por="-----111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x410">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELC0" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC1" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC2" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="WPUC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="WPUC" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x411">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUC0" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC1" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC2" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC3" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC4" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC5" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC6" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="ODCONC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="ODCONC" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x412">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCC0" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC1" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC2" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC3" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC4" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC5" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC6" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="SLRCONC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-1111111" edc:name="SLRCONC" edc:nzwidth="8" edc:por="-1111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x413">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRC0" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC1" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC2" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC3" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC4" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC5" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC6" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="INLVLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-1111111" edc:name="INLVLC" edc:nzwidth="8" edc:por="-1111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x414">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLC0" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC1" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC2" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC3" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC4" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC5" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLC6" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="IOCCP" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="IOCCP" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x415">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP2" edc:mask="0x1" edc:name="IOCCP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP6" edc:mask="0x1" edc:name="IOCCP6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="IOCCN" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="IOCCN" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x416">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN2" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN6" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
